{
  "date": "2021-01-25T19:25:26.335Z",
  "body": "<!--StartFragment-->\n\nUm Motor de Busca (em inglês: search engine) interno é um ponto muito importante para lojas virtuais, e quanto mais produtos e variações essa loja tiver mais importante essa ferramenta fica. É possível retirar o motor de buscas das lojas na E-Com Plus, mas só é aconselhável para lojas com menos de 10 produtos. \n\nDe acordo com o [UX Playbook for Retail do Google](https://services.google.com/fh/files/events/pdf_retail_ux_playbook.pdf), em média, usuários que pesquisam são 200% mais propensos a converter. Um motor de busca mal feito irá entregar para seu cliente uma experiência ruim. Também de acordo com o playbook, 22% das pesquisas não retornam resultados, 85% das pesquisas não retornam o que o usuário procura e nestes casos, 80% dos usuários abandonam o site.\n\nA maior parte dos e-commerces tem uma quantidade de produtos que torna inviável exibir tudo através de vitrines, e em muitos nichos a navegação por árvores de categorias em menus não é muito intuitiva para o cliente.\n\nApenas ter um motor de busca também não resolve todos os problemas de navegação é preciso que ele funcione corretamente, e de preferência que tenha alguns recursos a mais.  No [UX Playbook for Retail do Google](https://services.google.com/fh/files/events/pdf_retail_ux_playbook.pdf), são listadas as características de um motor de busca ideal. São elas: \n\n### Incluir um motor de busca\n\nEssa é a parte mais complexa, pois consiste na criação do motor de busca e a solução estará limitada às possibilidades do stack tecnológico que a plataforma utiliza. \n\nSua loja na E-Com Plus terá acesso a um motor de busca que utiliza o [Elasticsearch](https://www.elastic.co/pt/), que é capaz de obter respostas de pesquisa extremamente rápidas porque, em vez de pesquisar o texto diretamente, ele pesquisa um índice. Isso é mais ou menos como pesquisar uma palavra-chave examinando o índice no final de um livro, em vez de pesquisar cada palavra de cada página do livro.\n\n### Ter a busca sempre visível\n\nEsse ponto é relativamente simples. Por padrão, usuários que acessarem a loja virtual através de desktops já verão o campo de texto para buscas no cabeçalho sendo exibido em todas as páginas. Na versão Mobile é sempre exibido no cabeçalho o ícone de lupa, para não ocupar muito espaço da tela.\n\n### Usar sugestões automáticas (autocomplete) \n\nA ideia é sempre facilitar a vida do seu cliente, tentando diminuir a quantidade de cliques até finalizar a compra. Por que não diminuir a quantidade de teclas digitadas? Se nosso motor de busca identificar o que o cliente está para digitar, ele faz a sugestão para encurtar o caminho até o resultado. \n\n![](https://lh4.googleusercontent.com/eoYGIAo7glfRsRqzxSOmGHyhmLjPXQQgEu1MV2qtVi2bcplyDw2XBa7Z9-NA9D1eGgFZ9x7zjj_wO7KSQ_Uy1RpvONRGNEPsjqk5ZTnAJaqU-WL9nkFPJKOPhD1UUL6YlYUpHszW)\n\n### Implementar correção gramatical\n\nErros de gramática são mutio comuns quando se está digitando. Isso pode acontecer por não saber escrever a palavra (muito comum com termos em outras línguas), por conta de digitar uma tecla sem querer (muito comum em smartphones com tela pequena) ou por estar digitando um longo texto com velocidade (como é meu caso frequente com o muito x mutio). Corrigindo o erro agiliza para o usuário ou dá a oportunidade de escrever o outro termo corretamente. \n\n![](https://lh4.googleusercontent.com/QRVYelZG4g2X9kBfv6hHqLQhOx0sb6cOrbuyDRDhFbke1l15OkxKbyuhteAty3q_cvAB7bvwS2acUyGmdMNji7mHUntrIXHhUIT6lzolQUddFGW22OCXN6BNVS-6jbRGZY5yGxva)\n\n### Sempre retornar algum resultado\n\nAo clicar no motor de busca de uma loja na E-Com Plus o cliente já verá os produtos populares, aqueles que entendemos que tem mais chances desse usuário estar procurando. O mesmo acontece caso o cliente pesquise por um termo que não foi encontrado em nenhum recurso da loja.\n\n![](https://lh5.googleusercontent.com/3XMqq41KpMOcO-e4ucFr8YKw-vhL1I_f7R0qEWH5OsJfCxp1DdlUz3eZ3261IEz8Y1UJLjsJPi-ZU0Gz_qaydRG74MHKtUF86WLcYfBtjzDPc0CczJ9tVWCsEBBdOXMC4uaFB709)\n\n### Incluir histórico buscas\n\nQuando um cliente pesquisa um termo, volta na sua loja e clica novamente na busca tem grandes chances dele buscar aquele mesmo termo. Nosso motor de buscas salva os termos buscados pelo usuário mesmo sem ele estar logado e exibe como histórico em forma de link para pesquisar novamente com um único clique.\n\n![](https://lh5.googleusercontent.com/bvDqg4JwlVk6G2sPCVC-sW38UrTmATfGM6pI6bk7UY6oGuGADX2Q-KqZPNGoOLcTy2bodd1dtGmhhLa5pdHBfudaYntR7il52guo0I7KidAHAphmI7JElBHYVcH8ycs5q7p_alD4)\n\nOutros pontos que não são listados no playbook mas que julgamos ser também de estrema importância: \n\n### Resposta instantânea\n\nOs resultados da busca se alterando automaticamente de acordo com o que o usuário digita além de retirar o tempo de espera para a espera dos resultados do motor de busca, que dependendo da tecnologia pode demorar ALGUNS segundos, possibilita que encontre o que procura sem a necessidade de ir para a página de resultado de busca. Menos tempo e menos páginas para fechar a compra! \n\n### Infinitas possibilidades de filtros\n\nUm ponto crucial principalmente para lojas que tem uma grande quantidade de produtos que se assemelham de certa forma. Com filtros ágeis e com diversas possibilidades, o usuário pode ir variando os resultado de acordo com os filtros para encontrar o produto que mais lhe atenda. \n\n<!--EndFragment-->",
  "title": "A importância do motor de busca de um e-commerce. "
}