{
  "date": "2021-02-12T13:42:48.288Z",
  "title": "blog imbutido",
  "body": "<!--StartFragment-->\n\n# Loja virtual e blog em uma só solução\n\n![post de blog](/img/uploads/blog.png \"imagem de um post no blog \")\n\nCriar conteúdo é muito importante por diversos motivos, mas principalmente para educar os usuários e para que novos te encontrem. Nesse texto falarei sobre como fazer essas duas coisas através de um blog. \n\nNós não escrevemos textos como esse que você está lendo 😉, que não é exatamente um blog post mas funciona de forma parecida.\n\n### Utilizar o blog para educar seus clientes em potencial\n\nNesse texto a minha ideia é mostrar para você a importância de ter um blog principalmente para uma loja virtual, e se você está lendo até aqui provavelmente tem interesse em ter um blog. É um texto educativo, pois vou te ensinar algumas coisas mostrando que meu produto pode solucionar sua demanda. \n\nNesse caso o cliente já pode estar em seu site, e estar com algumas dúvidas antes de decidir a compra. Através do blog você pode fazer um post com as dúvidas mais comuns sobre o produto como esse [post](https://www.emporiotiasonia.com.br/posts/tudo-sobre-granolas-perguntas-e-respostas-2021-01-25) do blog da loja Tia Sônia (que não por coincidência utiliza a ferramenta de blogs da E-Com Plus).\n\n### Adquirir novos usuários através de tráfego orgânico\n\nO outro grande objetivo é que novos usuários encontrem seu site. Isso acontece pois quando usuários pesquisam por termos através de motores de busca como o [Google](https://www.google.com/), ele encontra as páginas que esses motores de busca entendem que melhor vão atender o que espera o usuário. \n\nAo escrever um post para o blog seguindo as boas práticas de SEO você criará um conteúdo que será com o tempo bem rankeado por motores de busca. SEO não se trata só de conteúdo mas também de tecnologia, mas desta parte nós tomamos conta para você.\n\nEsse outro [post](https://www.emporiotiasonia.com.br/posts/10-beneficios-da-granola-para-a-sua-saude-2020-05-22) do blog da tia Sônia é um ótimo exemplo. É um conteúdo na forma de lista, que é muito popular por esses 3 motivos: \n\n* Prático e prende ajuda a prender o leitor\n* Título do tipo “descubra os 5 motivos” incentivam o clique;\n* Cada item pode ser uma Heading Tag com boas palavras chaves sendo ótimo para SEO. \n\nCom esse post a loja indexou muito bem para um termo com um bom volume de pesquisa e aumentou em muito seu tráfego orgânico como relata o gestor nesse [vídeo](https://www.youtube.com/watch?v=iJ9_tBPkIX4). \n\nAgora falando especificamente das vantagens do blog da E-Com Plus: \n\n### O blog segue a mesma identidade visual da loja \n\nEsse é um ponto que é difícil de se ter quando o local de conversão é feito em um lugar distinto da ferramenta de Blog. Manter as cores e logo é tranquilo, mas os demais elementos que compõem os sites podem ser totalmente distintos. Isso pode levar a um estranhamento por parte do leitor que é redirecionado de um blog para a loja virtual, que ocasionará em uma diminuição da taxa de conversão. \n\n### Possibilidade de inserir CTAs com ofertas e produtos da loja\n\nAmbos posts citados do [blog da Tia Sônia](https://www.emporiotiasonia.com.br/blog) tem em seu fim uma estante de produtos, que poderiam também estar no meio do conteúdo, ou até ser um produto único. Com isso você já pode direcionar o cliente para o produto que se relaciona com o conteúdo que esse cliente está lendo, e por já estar na mesma estrutura boa parte do site já foi carregada e não precisará ser carregada novamente, fazendo o carregamento ser muito mais rápido.\n\n### Administração de posts no mesmo painel do visual da loja\n\nOs posts do blog estão em uma das seções do Storefront Editor, que é o editor de conteúdo do e-commerce na E-Com Plus. Isso facilita a administração de todo seu conteúdo, pois está tudo em um único mesmo painel. Com isso também não terá custos extras com uma ferramenta externa e/ou hospedagem externa só para o blog.\n\nO post do blog também pode utilizar das mais diversas seções que outras páginas da loja virtual podem utilizar, como Banners, Sliders de Banners, Grids de Banners, Temporizadores de ofertas, Estantes de produto e Códigos HTML personalizados entre outros. \n\n### Padrão de velocidade E-Com Plus\n\nComo já falado antes, a indexação não depende apenas do conteúdo, mas sim da experiência de quem busca como um todo. Caso o conteúdo esteja ótimo para a indexação mas não esteja de acordo com a expectativa do usuário ele rejeitará a página e sairá rapidamente, o mesmo ocorrerá caso a página demore muito a carregar. \n\nNós aqui na E-Com Plus nos preocupamos muito com performance do e-commerce e no blog não é diferente. O que há de melhor em tecnologia web sempre para entregar a melhor experiência possível para o usuário final. \n\n<!--EndFragment-->"
}