{
  "date": "2021-02-12T13:47:44.542Z",
  "body": "<!--StartFragment-->\n\n# Checkout e fluxo de compras que vende mais\n\n![](/img/uploads/checkout.png)\n\nO **checkout do Storefront da E-Com Plus** é um dos grandes diferenciais da nossa solução para e-commerces. Com uma UX que segue os nortes do UX playbook for retail do Google. Lojas que migram para a E-Com Plus quase como regra apresentam um [aumento na taxa de conversão](https://www.youtube.com/watch?v=NEY-w-w1JDs&feature=emb_logo), e o checkout é um dos motivos. \n\nNesse [vídeo](https://youtu.be/p4ZOn1V5smc) pode ver uma compra exemplo ser fechada, e caso queira fazer um teste por conta própria faça um pedido em nossa [loja demo](https://storefront-demo.e-com.plus/). \n\nAlguns dos diferenciais do nosso checkout: \n\n### Ofertas inteligentes para Up & cross sell\n\nTanto na página do carrinho quanto na finalização do pagamento o usuário recebe ofertas de produtos que possam lhe interessar. Esses produtos oferecidos não são aleatórios nem sempre os mesmos, são **escolhidos por uma inteligência que vai determinar os produtos mais prováveis de ser do interesse deste usuário específico**. Essa análise leva em conta as compras de outros clientes com perfil similar, produtos que têm sinergia, produtos mais populares entre outras informações. \n\nCom essas ofertas inteligentes você tende a aumentar o ticket médio da sua loja! \n\n### Gatilhos automáticos para informar frete grátis e promoções\n\nCaso você tenha uma regra de frete grátis é interessante que peça em troca um valor de pedido mínimo e informe isso para seu cliente. Além de banners e tarjas informando essa regra para frete grátis, na E-Com Plus o carrinho identifica sua regra de frete grátis e **informa para o cliente quanto mais ele deve adicionar ao carrinho para que consiga o desconto**. \n\nEsses dois pontos acima funcionam muito bem juntos. O cliente vê que falta um certo valor para obter frete grátis, e ao lado vê produtos que são do seu interesse e pode adicionar ao carrinho para pagar para receber mais produtos ao invés de pagar pelo frete. Veja um exemplo com esse carrinho na loja da [Tia Sônia](https://www.emporiotiasonia.com.br/):\n\n![](https://lh6.googleusercontent.com/rIeb6A4t4MS3k5Q0fS-76kNr0YC32C9fFpJrMb_M1hFXh8f6PkTjjqfM7wvCBv-uKWh0mpNbDjGe7zgZrKcy9zFAf5eWo_XFClAeRrG2RYdF-li205SLlNNF-ZBGBi_1xpYWz876)\n\n### Popup para produtos com opções\n\nEssa ferramenta é muito importante para a recomendação de produtos no carrinho e página de pagamento. Caso o cliente decida na página de carrinho comprar um produto que tem variações de tamanho, por exemplo, ele tem que escolher uma opção de tamanho. Em plataformas convencionais, se o cliente clicar nesse produto ele irá ser redirecionado para a página do produto, na E-Com Plus se abre uma popup para ele escolher a opção que deseja. \n\nEssa ferramenta **agiliza muito** o checkout nesses casos. \n\n### Carrinho como sidebar e página\n\nO resumo do carrinho como sidebar agiliza muito a visualização e administração do carrinho para o cliente, pois isso pode ser feito através de qualquer página da loja antes do checkout sem redirecionamentos.  \n\n### Cadastro sem senha e login social\n\nUm checkout sem senha além de **aumentar sua conversão** por agilizar o processo **aumenta a segurança** do seu cliente. Na hora de definir uma senha temos dois tipos de usuários com dois grandes problemas: \n\nUm tipo de usuário cria uma senha para cada loja virtual, marketplace, rede social e todo tipo de serviço web. Esse cliente anota tudo em um documento (o que não é nada seguro) ou sempre que vai fazer o login recorre ao recurso “esqueci a senha”, que **atrasa bastante o fluxo de compra e pode acabar desistindo**.\n\nO outro tipo de cliente coloca a mesma senha em tudo que usa. Esse corre um risco ainda maior, pois a senha em um lugar vazando ele fica vulnerável em todos outros serviços. Há toda uma indústria por trás do roubo de senhas. É fácil encontrar ferramentas gratuitas para quebrar senhas com até 55 caracteres realizando 8 milhões de tentativas por segundo.\n\nCom o cadastro sem senha e login social seu cliente entra com os dados de forma muito mais ágil e segura. \n\n### Diversas opções de pagamento com checkout transparente \n\nMuitas plataformas oferecem poucas opções para receber pagamentos, o que é uma **grande limitação para o lojista**. A forma de pagamento ideal depende do nicho e volume transacionado entre outras questões e engessar a forma de pagamento que será utilizada provocará ineficiências. \n\nAlgo similar acontece ao se tratar de pagamentos transparentes. O pagamento transparente é quando o cliente finaliza o pagamento na própria página da loja, sem a necessidade de redirecionamento para um ambiente externo. Por serem mais ágeis, os pagamentos transparentes entregam melhores taxas de conversão  que pagamentos com redirecionamento. \n\nPor diferenças em comissionamento, algumas plataformas oferecem apenas algumas ou uma única forma de pagamento no modo transparente. Isso obriga o cliente que quer ter um checkout transparente a utilizar o intermediador de pagamentos que é melhor para a plataforma, e não o que é melhor para sua loja. \n\nAqui na E-Com Plus temos **diversas integrações com intermediadores de pagamento, disponibilizados na forma transparente sempre que possível**. \n\n<!--EndFragment-->",
  "title": "cehckout"
}