{
  "date": "2021-02-12T14:22:48.240Z",
  "title": "performance",
  "body": "# A importância da performance técnica do seu e-commerce\n\n![homem de roupa social voando com velocidade](/img/uploads/performance.png \"performance para seu e-commerce\")\n\n<!--StartFragment-->\n\nA performance de uma página web é muito importante para que seus visitantes tenham uma boa experiência. **Uma página que não tem uma boa performance, vai demorar a carregar e isso vai aumentar a chance que o cliente desista de navegar pela sua página.**\n\nEsse gráfico mostra o quanto aumentam as chances de um usuário rejeitar a página de em diferentes tempos de carregamento quando comparado a uma página que leva 1 segundo para carregar.\n\n\n\n![](https://lh4.googleusercontent.com/I5ge18x_MVdjHruIDYXbZmROeuy9Zt_uFJAEsY9oIDkQthJ463q1urXbUkgUC01zcmGIlHZwl9lT8KucY7tsFPz2NQvzmwUV_VF6PhVhASSsONDAwKK-lLcuhtLOZ9LCWZT3r_75)\n\n\n\nA **experiência de usuário é chave no rankeamento que o Google** faz com as páginas. Para isso **o conteúdo** da sua página **deve atender o que o usuário procura**, e ser **entregue de forma rápida**. Então a performance também é um ponto crucial para o SEO da sua loja, tendo grande influência na indexação das páginas. \n\nA um bom tempo páginas que tenham acessibilidade em dispositivos móveis, navegação segura, conexão https e sem popups invasivas são consideradas pelo Google como páginas que oferecem uma boa experiência. A novidade que será implantada a partir de maio de 2021, como é dito [nesse artigo do Google](https://developers.google.com/search/blog/2020/11/timing-for-page-experience), é a avaliação da experiência de páginas também de acordo com o que o Google chama de **Core Web Vitals**, que em uma tradução seriam os **Sinais Vitais Centrais da Web.** \n\nOs Core Web Vitals são três métricas que o Google vai utilizar para medir se a página oferece uma boa experiência de usuário, com foco nos aspectos de carregamento, interatividade e estabilidade visual. \n\n![](https://lh4.googleusercontent.com/49TUXq2cIZNBa7mCDW7ZiJHOAoVDI3BgN88a7UZc2Mr6MLxOpP_RVvkjnKhhzv6AHEheEGko5NXYL_dt4IlOPDCTSVvhXR_zYW2IiXk3hJbFv-peaDn0ncYThQLuohCIsMU7j_aU)\n\nO que cada uma dessas métricas mede e o que é um bom resultado? \n\nLargest Contentful Paint (LCP): Mede o **desempenho de carregamento**. Para fornecer uma boa experiência ao usuário, os sites devem se esforçar para que o LCP ocorra nos primeiros 2,5 segundos após o início do carregamento da página.\n\nFirst Input Delay (FID): mede a **interatividade** de acordo com o atraso na primeira entrada. Para fornecer uma boa experiência de usuário, os sites devem se esforçar para ter um FID de menos de 100 milissegundos. \n\nCumulative Layout Shift (CLS): Mede a **estabilidade visual**. Para fornecer uma boa experiência do usuário, os sites devem se esforçar para ter uma pontuação CLS inferior a 0,1.\n\nE como saber como está um site de acordo com essas métricas? Você pode descobrir isso auditando seu site com o Google Lighthouse. Caso não tenha a extensão instalada em seu navegador, pode obter através desta [página](https://www.e-com.plus/google_lighthouse). \n\nE é claro que não estou falando disso tudo atoa, as **o Storefront da E-Com Plus possibilita que sua loja tenha ótimas notas nos Core Web Vitals**, como o relatório do Google Lighthouse abaixo da nossa [loja demo](https://storefront-demo.e-com.plus/): \n\n![](https://lh6.googleusercontent.com/85x9oCz8fyM-0TTbXy3nZkvpOKBNukWOjVt7C7tvUu3XVCt6NBS1GaibkzaThAZW8EhYGfylymXZT0IlyAdaFzwIsJIXTiN2oGtED0r2rs43P7xFf1il3LPFuwQjyFqMjhal_voX)\n\nO **LCP** está em 2,4 segundos, abaixo dos 2,5 considerados como ideais pelo próprio Google [aqui](https://developers.google.com/search/docs/guides/page-experience). O CLS está em 0,0003 bem abaixo dos 0,1 considerado como o ideal. \n\nNão é possível obter o **FID** através do Lighthouse, pois é uma métrica que requer um usuário real interagindo com a página. Mas como indicado [neste artigo](https://web.dev/fid/#how-to-measure-fid), a métrica de Total Blocking Time se correlaciona bem com o FID em campo e também captura problemas que afetam a interatividade. E o TBT neste lighthouse está em 110 ms, um pouco acima dos 100 ms indicados como ideiais. \n\nAlém desses pontos de mais destaque, a auditoria com o Google Lighthouse testa vários outros pontos. Alguns que são destaques negativos caso uma página não utilize são: \n\n* Serve images in next-gen formats ( trabalhar com **imagens de próxima geração como webp**)\n* Defer offscreen images ( só **carregar a imagem quando necessário**). \n\n<!--StartFragment-->\n\nPelas imagens serem arquivos pesados e e-commerces por padrão terem muitas imagens esses dois pontos tem muito impacto caso não sejam trabalhados. Nesse [vídeo](https://www.youtube.com/watch?v=-dpqEi-GH6c&t=2s) o Vitor fala um pouco sobre estes dois pontos.\n\n\n\n<!--EndFragment-->\n\n<!--EndFragment-->"
}