{
  "date": "2021-02-12T18:25:58.169Z",
  "body": "<!--StartFragment-->\n\nO produto é o coração de qualquer loja. Na E-Com Plus possibilitamos que crie seu produto com tudo o que precisa, utilizando recursos inexistentes nas outras plataformas com custo similar. \n\nNesse [vídeo](https://www.youtube.com/watch?v=xqfnzCgIqlM) você pode ver como é a criação de produtos em nosso painel, assim como alguns dos recursos listados abaixo.\n\nO produto é um dos recursos que é difícil listar em uma única página tudo o que é possível ser feito na E-Com Plus, são infinitas possibilidades. Nessa página estão listados os recursos mais usados e os que são grandes diferenciais que quase nenhuma solução de e-commerce no mundo suporta .\n\nCaso não encontre na lista o que precisa, entre em contato conosco através de um dos canais linkados no rodapé do site, pois é certo que conseguimos atender sua demanda seja ela qual for.\n\nEntão vamos lá: \n\n## Produto com opções\n\nProduto com opções é um recurso muito comum em plataformas de e-commerce, pois é uma forma de agrupar diferentes itens que facilita muito a usabilidade do cliente. No entanto muitas ferramentas para produtos com opções não são comumente encontradas em plataformas prontas, e o lojista acaba tentando solucionar com soluções open-source que trazem diversos outros problemas \n\nCriador de opções exponencial com todas possibilidades de acordo com os valores\n\nA primeira coisa para ter um produto com variações é definir as opções possíveis. [Nesse trecho do vídeo tutorial sobre produtos](https://youtu.be/xqfnzCgIqlM?t=995), você pode ver como isso funciona em nosso painel. \n\nQuanto mais grades e respectivos valores o produto tiver, mais opções esse produto terá e mais tempo nosso criador de opções irá te poupar. Vamos fazer um cálculo simples para entender melhor essa dinâmica:\n\nVou usar como exemplo um produto que todo mundo compra, uma camisa:\n\nA camisa tem 5 opções de cores: Preto, Branco, Azul, Vermelho e Cinza;  e 5 opções de tamanho: PP, P, M, G e GG. Fazendo todas as combinações possíveis, temos 25 possibilidades. Em nosso criador de variações **você entra com as grades e seus 10 valores e a plataforma cria essas 25 combinações de forma automática** (você pode selecionar algumas que não deseja criar), na maioria das plataformas você tem que criar essas 25 combinações. \n\nCaso queira inserir mais uma grade simples como por exemplo Gola, com apenas dois valores: Sim e Não, você vai apenas criar a grade e inserir esses dois valores e o criador de variações criará mais 25 possibilidades, totalizando agora 50. Sem essa ferramenta, você teria que criar mais 25 possibilidades manualmente, gastando muito mais tempo. \n\nA edição dos dados específicos de cada opção listado abaixo pode ser vista nesse [trecho do vídeo mostrando a criação de produtos](https://youtu.be/xqfnzCgIqlM?t=1060).  \n\n#### Imagem específica por opção \n\nDependendo da opção escolhida pelo cliente ela é visualmente distinta das outras como por exemplo uma variação de cor. Nesse caso é interessante que a imagem mude de acordo com a opção escolhida pelo cliente, para que ele veja de forma automática a imagem do produto que está prestes a comprar e possa melhor visualizá-lo. \n\n#### Preço e desconto específicos por opção\n\nAlgumas variações de produtos terão preços e descontos diferentes de acordo com a estratégia do lojista ou seus custos. Com estes campos você consegue ter mais controle sobre as variações e ter estratégias bem definidas neste nível. É possível também definir aumentos de preços (percentuais ou em R$ fixos) específicos por grade ou valor de grade.\n\n#### Informações de frete e prazo de produção por opção \n\nEssa é uma ferramenta que poucas plataformas oferecem. Na maior parte das lojas, as variações de produtos são idênticas aos olhos das transportadoras, mas esse padrão não se aplica a todas lojas. \n\nUm exemplo que foge a esta regra é uma loja que vende quadros decorativos em diferentes tamanhos. Um quadro de 20cm x 20cm, ocupa menos espaço e pesa menos que a mesma arte em um quadro de 50cm x 50cm. É uma grande ineficiência quando uma loja cobra o mesmo valor de frete para essas opções por conta de uma limitação da solução de e-commerce que não permite definir as dimensões por variação. Isso não acontece na E-Com Plus.\n\n#### Estoque, SKU ,GTIN e MPN específicos por opção\n\nDados cruciais para que uma loja administre seus produtos por variação. Caso sua plataforma não permita essa edição, migre dela o quanto antes possível. \n\n## Produto personalizado\n\nUma grande tendência é ter uma loja com produtos personalizados. Isso se aplica a vários nichos onde o cliente quer um produto único que seja sua cara, inserindo seu nome, foto \n\nAlguns exemplos bem comuns de lojas que utilizam esse recurso: \n\n#### Loja virtual de artigos esportivos como camisas de futebol \n\nCom a E-Com Plus você pode vender camisas de times de futebol e outros esportes e criar campos para que seu cliente estampe seu nome e/ou número preferido na camisa. \n\n#### E-commerce de quadros e capinhas de celular customizadas\n\nCom esse nível de customização você permite que o cliente literalmente dê sua cara para o produto. Podendo subir imagens e outros tipos de arquivos, são muitas possibilidades para que o cliente customize seu produto \n\n\n\n## Produto tipo kit\n\nOferecer conjuntos de produtos que tenham sinergia é uma ótima maneira de **descarregar o estoque, aumentar o ticket médio da e melhorar a conversão da sua loja**. \n\nO kit é quando você cria um “produto” com um único SKU que é feito de outros produtos. Ao combinar diferentes itens, você cria um kit. Por exemplo, se você vende um conjunto de talheres com facas, e uma tábua de cortar você está vendendo um kit. Outra forma de utilizar o kit é agrupando mais unidades do mesmo item que normalmente o cliente precisa de mais de um, como vender quatro taças de vinho juntas. \n\nNormalmente, você faz kits de itens complementares que funcionam bem juntos e agrupa itens de que uma pessoa normalmente precisaria mais de um de cada vez. Vários itens são combinados e vendidos como um SKU individual, e sua disponibilidade respeita o estoque dos itens vinculados. \n\nO criador de kits e pacotes da E-Com Plus pode ser visto nesse trecho de [vídeo](https://youtu.be/jJNej8mZWtI). \n\nUma possibilidade muito interessante e que não é comumente encontrada em soluções de e-commerce é o **kit editável**. Com o kit editável você define os produtos que compõem o kit e deixa que **o cliente escolha a quantidade de cada item que deseja levar**, definindo um mínimo e máximo de unidades totais. Esse [produto](https://duasxicaras.netlify.app/kit-10-caixas-de-capsulas-de-cafe-compativeis-com-nespresso) da loja Duas Xícaras é um exemplo disso, e você pode ver como fazer a configuração neste [vídeo](https://www.youtube.com/watch?v=OOnefO3NSzE). \n\nOutros recursos:\n\n* #### Produto digital\n* #### Imagens do produto em formato webp, [veja mais](https://www.e-com.plus/imagens-de-proxima-geracao) \n* #### Diferentes ceps por produto / Multi CD (Centros de distribuição)\n* #### Descontos com data de fim programada ou não \n* #### Controle de estoque, automático ou não \n* #### Deixar produto indisponível para compra ou invisível para o cliente\n* #### Organização em categorias, marcas e coleções\n* #### Infinitas possibilidades de filtros na loja e no painel\n* #### Listar com produto específico\n* #### Histórico de edições no produto\n* #### Preço médio de venda\n* #### Inventário de produtos \n* #### Importação e exportação de todos dados do produto via tabela \n* #### Edição em massa de categorias, coleções, estoque, desconto, \n\n  #### ativar/desativar, exibir/esconder\n\n<!--EndFragment-->",
  "title": "Produtos"
}