{
  "date": "2021-02-12T14:43:00.574Z",
  "title": "ux",
  "body": "# A importância do UX design nos resultados do seu e-commerce\n\n![usuário navegando por loja virtual](/img/uploads/ux.png \"experiência de usuário no e-commerce\")\n\n<!--StartFragment-->\n\nUX (User Experience) significa experiência do usuário, como é a interação dos usuários em todos os pontos do produto. Então UX Design é uma forma de projetar um produto para entregar a melhor **experiência possível a seus usuários**, sempre de acordo com dados obtidos através de experiências e pesquisas. \n\nEmbora o UX Design seja considerado essencial para o desenvolvimento de produtos por muitas empresas, o próprio termo pode parecer apenas mais um daqueles jargões repetidos com exaustão em encontros de startups e empreendedores descolados. \n\nAqui na E-Com Plus nós temos muito cuidado com a experiência do usuário, tanto a do lojista que utilizará nossas interfaces, quanto dos seus clientes, que vão ingressar em uma **jornada de compras** em lojas virtuais que utilizam nossa tecnologia.\n\nNa criação do [Storefront](https://github.com/ecomplus/storefront#storefront), que é nossa solução de frontend de e-commerce, além de aplicarmos tudo **o que aprendemos sobre UX em e-commerces com os mais de 4 anos com a [E-Com Club](https://e-com.club/)**, utilizamos como referência os dados contidos no **UX Playbook for Retail feito pelo Google**. \n\nAntes de continuar a falar sobre UX Playbook for Retail, gostaria de ressaltar que o [Storefront](https://github.com/ecomplus/storefront#storefront) é feito com arquitetura PWA & JAMstack, Micro-frontends, é extensível, tem suporte para [internacionalização](https://github.com/ecomplus/i18n#i18n), em conformidade com o [a11yproject](https://www.a11yproject.com/checklist/#toc_Success-criteria) e sempre em busca de obter notas máximas na auditoria do [Google Lighthouse](https://developers.google.com/web/tools/lighthouse?hl=pt_br). \n\nO UX Playbook for Retail é um guia feito pelo Google com as **melhores práticas universais para a experiência de usuário em lojas virtuais**. O pdf de 108 páginas foi feito após a empresa **analisar centenas de e-commerces de alta performance**. \n\nOs insights são baseados em análises científicas e testes A / B, incluindo citações de uma ampla gama de pesquisas e artigos. \n\nO e-book é indexado pelo Google e está disponível gratuitamente online neste [link](https://services.google.com/fh/files/events/pdf_retail_ux_playbook.pdf). No entanto, não está claro de vem este documento. O e-book divide a loja virtual nas seis seguintes seções:\n\n* Home / Landing Page\n* Menu e navegação\n* Pesquisa\n* Categoria / Produto\n* Conversão\n* Otimização de Formulário\n\nComo um exemplo da profundidade que o livro oferece, o playbook de varejo do Google oferece oito insights para a criação da melhor página inicial:\n\n* CTAs na primeira parte da página\n* CTAs descritivos\n* Proposta de valor clara na primeira parte da página\n* Não use popups de página inteira\n* Remova carrosséis automáticos\n* Exibia categorias principais na página inicial\n* Use tamanhos de fonte legíveis\n* Use prova social\n\nAlguns desses pontos acima podem soar como bom senso, mas quando você ler as seções, verá que os links para artigos e pesquisas fornecem mais informações sobre por que algo funciona. Embora o e-book tenha 108 páginas, **os vários links para leitura adicional facilmente triplicam a quantidade de páginas a serem lidas** para compreender totalmente e dominar todas essas dicas para aumentar as vendas em um e-commerce.\n\nUma das dicas que acho muito interessante e está **longe de ser “bom senso”** pelos e-commerces aqui é a seguinte:\n\n### Não use sliders na página inicial\n\nUma pesquisa feita na Universidade Notre Dame mostrou que os efeitos negativos de um carrossel de imagens superam em muito qualquer benefício percebido. Esse experimento mostrou o quão baixa é a interação com os banners de um slider que não seja o primeiro. **Além de ser pouco efetivo, sliders acabam atrapalhando a performance do site por carregar mais imagens**, principalmente se não utilizar um lazy-loading. Além da performance, sliders automáticos **tiram a atenção do resto do conteúdo**, pois o olho humano dá atenção ao movimento e acredito que você não pretende dar destaque para o segundo ou terceiro banner de um slider. \n\nNesse teste da Universidade Notre Dame **84% das interações com o slider foram com o primeiro banner**, os demais 4 tiveram aproximadamente 4% cada. \n\n![](https://lh4.googleusercontent.com/-B11MdAzqAnKsMRlj2ZaUc8wYDG4hnWcWXLPChbRTyWV3nfwzKx95WJ2Z7jei--amf-vYdoh8t1Qzi1syxn4WhOvvy0gpvLOYplOeg7k0MOEsA7PCczKnaV1FKNO-GmfBb9RqrA1)\n\n### Tenha um motor de buscas poderoso\n\nOutro exemplo muito interessante e que poucas lojas fazem as boas práticas, acredito que por limitações técnicas, é a seção sobre motores de busca. As dicas são as seguintes: \n\n* Ter um motor de buscas \n* Ação de buscar visível \n* Usar **sugestões de busca automáticas** \n* **Correção gramatical** \n* **Sempre retornar algum resultado** \n* **Incluir histórico de buscas**\n\nQuer ver como funciona um motor de busca com **todas essas características**? Faz uma busca de testes na [loja exemplo da E-Com Plus](https://storefront-demo.e-com.plus/). \n\nDe acordo com o Google os usuários que pesquisam têm **200% mais probabilidade de converter**, em média. Um motor de busca otimizado é muito importante, principalmente para lojas que tem uma quantidade relevante de produtos.\n\n### Limite pontos de saída no checkout\n\nA partir do momento que um usuário entra no fluxo de checkout, evite mostrar buscas, menu de categorias e outros pontos de saída. O Google recomenda permitir que os usuários retornem à página inicial, ao carrinho de compras ou a um contato de suporte. O Google é enfático em que o menu padrão não seja mostrado.\n\n![“Secret” Google Playbook Shows How to Improve Ecommerce Sales](https://lh6.googleusercontent.com/349P8nwL0WmJD01jLL6wDmGoN51Y3pyIm6Z7DWYHE0BQ8i58jtk1emPEotIid5Z0YX_unnhQSnLBK1hk6kLVQWlpo4Dz21KwaycTC5-TNZK9i50nkgCEGL6d5sH8gSvZNYFGcIcc)\n\nSão várias as melhorias em cada uma das seções, e em cada uma o google mostra qual a dificuldade de implementação, o nível de impacto e a métrica impactada.\n\n![](https://lh4.googleusercontent.com/eAkx3GXc9HZmrG81ZmPhYtc3WqXrpou13XN0ISsUYSR95VNZy9g8W1mbLDGNTNFD9q6sd7IAwlAZe2J3cXUTfTN4DWokqBiy8WqGJYOhHuFKCb4cKPWV9rmk2AZkNxcK3LpfkCC_)\n\nComo disse no início desta página, muitos desses pontos soam como “bom senso” mas a grande maioria das plataformas não implementam por padrão, por desconhecimento e/ou incapacidade técnica. Você pode ver o playbook na íntegra neste [link](https://services.google.com/fh/files/events/pdf_retail_ux_playbook.pdf), e caso queira ter um e-commerce que siga todos as boas práticas de UX de acordo com este estudo do Google, basta criar uma loja na [E-Com Plus](https://www.e-com.plus/).\n\n<!--EndFragment-->"
}